In [1]:
import pandas as pd
import numpy as np

# Creating Dataframe Objects

In [5]:
arr = np.random.randint(0,10,(5,3))

In [6]:
arr

array([[6, 4, 5],
       [7, 1, 1],
       [7, 2, 2],
       [2, 0, 4],
       [8, 3, 9]])

In [8]:
df =  pd.DataFrame(arr)

In [9]:
df

   0  1  2
0  6  4  5
1  7  1  1
2  7  2  2
3  2  0  4
4  8  3  9

In [10]:
df.values

array([[6, 4, 5],
       [7, 1, 1],
       [7, 2, 2],
       [2, 0, 4],
       [8, 3, 9]])

In [13]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [15]:
for i in df.columns:
    print(i)

0
1
2

In [16]:
df.values[0]

array([6, 4, 5])

In [18]:
df.index = ["R1", "R2", "R3", "R4", "R5"]
df.columns = ["C1", "C2", "C3"]

In [19]:
df

    C1  C2  C3
R1   6   4   5
R2   7   1   1
R3   7   2   2
R4   2   0   4
R5   8   3   9

In [21]:
df.loc['R3','C2']

2

In [22]:
df.iloc[2,1]

2

In [23]:
df.iloc[2:4,1:3]

    C2  C3
R3   2   2
R4   0   4

In [25]:
type(df.iloc[2:4,1:3])

pandas.core.frame.DataFrame

In [27]:
df.loc['R3':'R5', 'C1':'C2'] #last element also considered

    C1  C2
R3   7   2
R4   2   0
R5   8   3

In [28]:
df.iloc[0] #returns a series

C1    6
C2    4
C3    5
Name: R1, dtype: int32

In [29]:
type(df.iloc[0])

pandas.core.series.Series

In [30]:
df.iloc[:,0]

R1    6
R2    7
R3    7
R4    2
R5    8
Name: C1, dtype: int32

In [31]:
df.shape

(5, 3)

In [32]:
df.T

    R1  R2  R3  R4  R5
C1   6   7   7   2   8
C2   4   1   2   0   3
C3   5   1   2   4   9

Task:

Create a dataframe with n rows and m columns with random numbers bw 0 and 10

In [4]:
def df_create(n,m):
    arr = np.random.randint(0,10,(n,m))
    df = pd.DataFrame(arr)
    df.index = ['R' + str(x) for x in np.arange(1,n+1)]
    df.columns = ['C' + str(x) for x in np.arange(1,m+1)]
    return df

In [42]:
df_create(5,3)

    C1  C2  C3
R1   1   5   6
R2   1   4   8
R3   7   9   7
R4   4   6   6
R5   5   2   7

In [43]:
df_create(1,2)

    C1  C2
R1   5   8

In [44]:
df_create(2,5)

    C1  C2  C3  C4  C5
R1   2   9   5   1   3
R2   5   4   5   6   2

In [2]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], index = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879,	12104,	12756,	6792,	142984,120536,	51118,	49528,	2370, 3475.0], index = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto', 'Moon'])

In [70]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [71]:
diameter

Mercury      4879.0
Venus       12104.0
Earth       12756.0
Mars         6792.0
Jupiter    142984.0
Saturn     120536.0
Uranus      51118.0
Neptune     49528.0
Pluto        2370.0
Moon         3475.0
dtype: float64

In [3]:
df = pd.DataFrame({'Mass': mass, "Diameter":diameter})

In [35]:
df

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [74]:
df['Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [75]:
df['Diameter']

Earth       12756.0
Jupiter    142984.0
Mars         6792.0
Mercury      4879.0
Moon         3475.0
Neptune     49528.0
Pluto        2370.0
Saturn     120536.0
Uranus      51118.0
Venus       12104.0
Name: Diameter, dtype: float64

In [76]:
df.Mass.Earth

5.97

In [6]:
df['Population'] = 0

In [7]:
df

              Mass  Diameter  Population
Earth       5.9700   12756.0           0
Jupiter  1898.0000  142984.0           0
Mars        0.6420    6792.0           0
Mercury     0.3300    4879.0           0
Moon           NaN    3475.0           0
Neptune   102.0000   49528.0           0
Pluto       0.0146    2370.0           0
Saturn    568.0000  120536.0           0
Uranus     86.8000   51118.0           0
Venus       4.8700   12104.0           0

In [9]:
df.Population.Earth = 8000000000

In [10]:
df

              Mass  Diameter  Population
Earth       5.9700   12756.0  8000000000
Jupiter  1898.0000  142984.0           0
Mars        0.6420    6792.0           0
Mercury     0.3300    4879.0           0
Moon           NaN    3475.0           0
Neptune   102.0000   49528.0           0
Pluto       0.0146    2370.0           0
Saturn    568.0000  120536.0           0
Uranus     86.8000   51118.0           0
Venus       4.8700   12104.0           0

In [81]:
df['Mass'] is df.Mass

True

In [82]:
df['Population'] is df.Population

True

Task:

Create a new row 'Mean' and compute mean of columns

In [97]:
df.loc["Mean"] = 0

In [103]:
df

              Mass  Diameter  Population
Earth       5.9700   12756.0  8000000000
Jupiter  1898.0000  142984.0           0
Mars        0.6420    6792.0           0
Mercury     0.3300    4879.0           0
Moon           NaN    3475.0           0
Neptune   102.0000   49528.0           0
Pluto       0.0146    2370.0           0
Saturn    568.0000  120536.0           0
Uranus     86.8000   51118.0           0
Venus       4.8700   12104.0           0
Mass        0.0000       0.0           0
Mean        0.0000       0.0           0

In [105]:
df

              Mass  Diameter  Population
Earth       5.9700   12756.0  8000000000
Jupiter  1898.0000  142984.0           0
Mars        0.6420    6792.0           0
Mercury     0.3300    4879.0           0
Moon           NaN    3475.0           0
Neptune   102.0000   49528.0           0
Pluto       0.0146    2370.0           0
Saturn    568.0000  120536.0           0
Uranus     86.8000   51118.0           0
Venus       4.8700   12104.0           0
Mean        0.0000       0.0           0

In [112]:
df.mean(axis=1,skipna=True)

Earth      2.666671e+09
Jupiter    4.829400e+04
Mars       2.264214e+03
Mercury    1.626443e+03
Moon       1.737500e+03
Neptune    1.654333e+04
Pluto      7.900049e+02
Saturn     4.036800e+04
Uranus     1.706827e+04
Venus      4.036290e+03
Mean                NaN
dtype: float64

In [5]:
df

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [12]:
df.loc[:,"Mass"]

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [5]:
def mean_row(df):
    #df.loc['Col_Mean'] = [np.mean(df[Col]) for Col in df.columns]
    df.loc['Col_Mean'] = df.mean()
    return df

In [13]:
df.loc['Col_Mean'] = 0

In [14]:
df

               Mass  Diameter  Population
Earth        5.9700   12756.0  8000000000
Jupiter   1898.0000  142984.0           0
Mars         0.6420    6792.0           0
Mercury      0.3300    4879.0           0
Moon            NaN    3475.0           0
Neptune    102.0000   49528.0           0
Pluto        0.0146    2370.0           0
Saturn     568.0000  120536.0           0
Uranus      86.8000   51118.0           0
Venus        4.8700   12104.0           0
Col_Mean     0.0000       0.0           0

In [18]:
np.mean(df['Mass'])

266.66266

In [33]:
df.drop('Col_Mean', inplace = True)

KeyError: "['Col_Mean'] not found in axis"

In [42]:
df.drop('Col_Mean', axis =1, inplace=True)

In [43]:
df

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [25]:
np.mean(df["Mass"])

296.29184444444445

In [26]:
df.loc['Col_Mean'] = [np.mean(df["Mass"]), np.mean(df["Diameter"])]

In [47]:
mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [50]:
df = df_create(5,3)

In [51]:
df

    C1  C2  C3
R1   4   1   5
R2   5   9   5
R3   2   8   9
R4   7   7   8
R5   6   1   6

In [52]:
df.mean()

C1    4.8
C2    5.2
C3    6.6
dtype: float64

In [54]:
df.mean(axis=1)

R1    3.333333
R2    6.333333
R3    6.333333
R4    7.333333
R5    4.333333
dtype: float64

In [55]:
df['Row_Mean'] = df.mean(axis=1)
df.loc['Column_Mean'] = df.mean()

In [56]:
df

              C1   C2   C3  Row_Mean
R1           4.0  1.0  5.0  3.333333
R2           5.0  9.0  5.0  6.333333
R3           2.0  8.0  9.0  6.333333
R4           7.0  7.0  8.0  7.333333
R5           6.0  1.0  6.0  4.333333
Column_Mean  4.8  5.2  6.6  5.533333

In [57]:
df.describe()

             C1        C2        C3  Row_Mean
count  6.000000  6.000000  6.000000  6.000000
mean   4.800000  5.200000  6.600000  5.533333
std    1.720465  3.487119  1.624808  1.469694
min    2.000000  1.000000  5.000000  3.333333
25%    4.200000  2.050000  5.250000  4.633333
50%    4.900000  6.100000  6.300000  5.933333
75%    5.750000  7.750000  7.650000  6.333333
max    7.000000  9.000000  9.000000  7.333333

In [59]:
df.T.describe()

             R1        R2        R3        R4        R5  Column_Mean
count  4.000000  4.000000  4.000000  4.000000  4.000000     4.000000
mean   3.333333  6.333333  6.333333  7.333333  4.333333     5.533333
std    1.699673  1.885618  3.091206  0.471405  2.357023     0.771722
min    1.000000  5.000000  2.000000  7.000000  1.000000     4.800000
25%    2.750000  5.000000  5.250000  7.000000  3.500000     5.100000
50%    3.666667  5.666667  7.166667  7.166667  5.166667     5.366667
75%    4.250000  7.000000  8.250000  7.500000  6.000000     5.800000
max    5.000000  9.000000  9.000000  8.000000  6.000000     6.600000

In [60]:
df

              C1   C2   C3  Row_Mean
R1           4.0  1.0  5.0  3.333333
R2           5.0  9.0  5.0  6.333333
R3           2.0  8.0  9.0  6.333333
R4           7.0  7.0  8.0  7.333333
R5           6.0  1.0  6.0  4.333333
Column_Mean  4.8  5.2  6.6  5.533333

In [61]:
planets = pd.DataFrame({"Mass": mass, "Diameter": diameter})

In [62]:
planets

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [63]:
planets.describe()

              Mass      Diameter
count     9.000000      10.00000
mean    296.291844   40654.20000
std     627.786429   51541.39142
min       0.014600    2370.00000
25%       0.642000    5357.25000
50%       5.970000   12430.00000
75%     102.000000   50720.50000
max    1898.000000  142984.00000

In [2]:
import seaborn as sns

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [78]:
planets = sns.load_dataset('planets') #returms a dataframe

In [4]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [14]:
planets.info()
#planets discovered across the universe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [16]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [17]:
planets.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [19]:
planets.describe() #ignores non numerical values

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

Go through each row and delete if any column is null

In [7]:
for i in planets.index:
    for j in planets.columns:
        if pd.isnull(planets.loc[i,j]):
            planets.drop(i, inplace=True)
            break

In [10]:
planets.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [13]:
for i,r in planets.iterrows():
    print(i,"\n",r)
    break

0
 method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [17]:
for i,r in planets.iterrows():
    if (pd.isnull(r).any()):
         planets.drop(i, inplace=True)

In [18]:
planets.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [43]:
planets.dropna(inplace=True)

In [44]:
planets.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Filter and show the rows that have planets found in 2010s and method is 'Radial Velocity' and 'Transit' and distance is > 75 percentile

In [41]:
# select  * from planets where year >= 2010 and method = "Radial Velocity" and "Transit" and distance > (75/100 x x)

In [45]:
df = planets.copy()
q3 = planets.distance.quantile(0.75)
for i,r in df.iterrows():
    if r['year'] < 2010:
        df.drop(i, inplace=True)
        continue
    if r['method'] != "Radial Velocity" and r['method'] != "Transit":
        df.drop(i, inplace=True)
        continue
    if r['distance'] < q3:
        df.drop(i, inplace=True)
        continue

In [47]:
df.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [48]:
q3

59.3325

In [56]:
df = planets.copy()
df = df[
    (df['year']>=2010) &
    ((df['method'] == "Radial Velocity") | (df['method'] == "Transit")) &
    ( df['distance'] >= q3)
] # wayto query in pandas - using indexing

In [57]:
df.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

Modify method column to have abbreviations of each method

In [60]:
planets.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [66]:
s = "Orbital Brightness Modulation"
l = s.split()
abb = ""
for i in l:
    abb = abb+i[0]
abb

'OBM'

In [67]:
''.join([x[0] for x in s.split(' ')])

'OBM'

In [69]:
abb_names = {}
for i in planets.method.unique():
    abb_names[i] = ''.join([x[0] for x in i.split(' ')])

In [70]:
abb_names

{'Radial Velocity': 'RV',
 'Imaging': 'I',
 'Eclipse Timing Variations': 'ETV',
 'Transit': 'T',
 'Astrometry': 'A',
 'Transit Timing Variations': 'TTV',
 'Orbital Brightness Modulation': 'OBM',
 'Microlensing': 'M',
 'Pulsar Timing': 'PT',
 'Pulsation Timing Variations': 'PTV'}

In [75]:
for i, r in planets.iterrows():
    planets.loc[i, 'Short Method'] = abb_names. get(r['method'], r['method'])

In [76]:
planets.head()

            method  number  orbital_period   mass  distance  year Short Method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

In [77]:
planets.tail()

       method  number  orbital_period  mass  distance  year Short Method
1030  Transit       1        3.941507   NaN     172.0  2006            T
1031  Transit       1        2.615864   NaN     148.0  2007            T
1032  Transit       1        3.191524   NaN     174.0  2007            T
1033  Transit       1        4.125083   NaN     293.0  2008            T
1034  Transit       1        4.187757   NaN     260.0  2008            T

In [80]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [81]:
def add_abbr(s):
    return abb_names. get(s,s)

In [82]:
planets['Short Method'] = planets['method'].apply(add_abbr)

In [83]:
planets.head()

            method  number  orbital_period   mass  distance  year Short Method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

Count number of planets found based on each method

1. **Split** the  dataframe into smaller chunks(they should have the same method name)
2. **Apply** some function in each smaller chunk (count in this case)
3. **Aggregate** the results from each chunk together

In [93]:
d = {}
for i in planets.method.unique():
    d[i] = (planets[planets.method == i]['method'].count())
print(d)

{'Radial Velocity': 553, 'Imaging': 38, 'Eclipse Timing Variations': 9, 'Transit': 397, 'Astrometry': 2, 'Transit Timing Variations': 4, 'Orbital Brightness Modulation': 3, 'Microlensing': 23, 'Pulsar Timing': 5, 'Pulsation Timing Variations': 1}

In [95]:
planets.groupby('method')['method'].count()
# splits data based column/s; subsetting based on column/s; counts group and implicitly adds it and prints as series

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

Find out what fraction of planets have been found in the last decade

1. **Filter** the data out (planet in last decade)
2. **Split** the  dataframe into smaller chunks(they should have the same method name)
3. **Apply** some function in each smaller chunk (count in this case)
4. **Aggregate** the results from each chunk together

In [99]:
s_2010s = planets[planets.year>=2010].groupby('method')['method'].count()

In [100]:
s_all = planets.groupby('method')['method'].count()

In [101]:
s_2010s/s_all

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

Find a dataset of Nifty numbers for 2018 and 2019 - daily numbers open, close, high, low

In [110]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv', index_col = 0) #doesnt add a separate index and makes 0th column the index

In [111]:
nifty50_2018.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [112]:
nifty50_2018.loc['31 Dec 2018']

Open     10913.20
High     10923.55
Low      10853.20
Close    10862.55
Name: 31 Dec 2018, dtype: float64

In [109]:
nifty50_2018['Open']

Date
31 Dec 2018    10913.20
28 Dec 2018    10820.95
27 Dec 2018    10817.90
26 Dec 2018    10635.45
24 Dec 2018    10780.90
                 ...
05 Jan 2018    10534.25
04 Jan 2018    10469.40
03 Jan 2018    10482.65
02 Jan 2018    10477.55
01 Jan 2018    10531.70
Name: Open, Length: 246, dtype: float64

In [113]:
nifty50_2019 = pd.read_csv('NIFTY50_2019.csv', index_col = 0)

In [114]:
nifty50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [118]:
nifty50_2018.shape, nifty50_2019.shape

((246, 4), (245, 4))

In [122]:
nifty50 = pd.concat([nifty50_2018, nifty50_2019]) #concatenates rows

In [123]:
nifty50.shape

(491, 4)

In [124]:
niftynext50_2019 = pd.read_csv('NIFTYNext50_2019.csv', index_col = 0)

In [125]:
niftynext50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  28495.00  28549.50  28270.25  28307.55
30 Dec 2019  28528.95  28612.95  28406.70  28484.85
27 Dec 2019  28354.50  28500.25  28319.90  28476.80
26 Dec 2019  28409.10  28435.25  28259.75  28280.25
24 Dec 2019  28423.70  28430.40  28318.75  28382.85

In [129]:
nifty2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1)
#concats along columns

In [130]:
nifty2019.head()

,Open,High,Low,Close,Open,High,Low,Close
Date,,,,,,,,
31 Dec 2019,12247.10,12247.10,12151.80,12168.45,28495.00,28549.50,28270.25,28307.55
30 Dec 2019,12274.90,12286.45,12213.80,12255.85,28528.95,28612.95,28406.70,28484.85
27 Dec 2019,12172.90,12258.45,12157.90,12245.80,28354.50,28500.25,28319.90,28476.80
26 Dec 2019,12211.85,12221.55,12118.85,12126.55,28409.10,28435.25,28259.75,28280.25
24 Dec 2019,12269.25,12283.70,12202.10,12214.55,28423.70,28430.40,28318.75,28382.85

In [132]:
nifty2019.shape

(245, 8)

**Hierarchical indexing**

In [133]:
nifty2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1, keys=['Nifty50', 'NiftyNext50'])

In [135]:
nifty2019.head()

              Nifty50                               NiftyNext50            \
                 Open      High       Low     Close        Open      High
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45    28495.00  28549.50
30 Dec 2019  12274.90  12286.45  12213.80  12255.85    28528.95  28612.95
27 Dec 2019  12172.90  12258.45  12157.90  12245.80    28354.50  28500.25
26 Dec 2019  12211.85  12221.55  12118.85  12126.55    28409.10  28435.25
24 Dec 2019  12269.25  12283.70  12202.10  12214.55    28423.70  28430.40


                  Low     Close
Date
31 Dec 2019  28270.25  28307.55
30 Dec 2019  28406.70  28484.85
27 Dec 2019  28319.90  28476.80
26 Dec 2019  28259.75  28280.25
24 Dec 2019  28318.75  28382.85

In [138]:
nifty2019['Nifty50'].loc['31 Dec 2019']

Open     12247.10
High     12247.10
Low      12151.80
Close    12168.45
Name: 31 Dec 2019, dtype: float64

Tasks on Nifty datasets:

1. In 2019, in how many days was the NIFTY50 volatile (high > 105% of the low)                            

2. In 2019, in how many days was the NIFTYNEXT50 volatile

3. In 2019, how many days belonged to the four classes NIFTY50 volatile/ non-volatile and NIFTYNext50 volatile/non-volatile

4. Compute the mean, median, std, var of each weekday in NIFTY50 for 2019.

5. Compute the mean, median, std, var of each weekday in NIFTYNEXT50 for 2019.

6. On the days on which NIFTY50 closed higher than the open, what is the mean of (close-open) for NIFTYNEXT50.

7. In 2019, how many days had the day's high lower than the previous day's low in NIFTY50.

8. In 2019, on how many days did the day's close exceed the 30 day moving average in NIFTY50(exclude first month).

**TEST**

In [11]:
data = [['A', 10],['B',15],['C',14],['D',14]]
df = pd.DataFrame(data, columns=['Name',"Age"])
grp = df.groupby('Age')
for g in grp:
    print(type(g[1]))
    break

<class 'pandas.core.frame.DataFrame'>